spec/load-test-api.yml

config:
  target: "http://localhost:4003"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 10
      name: "warmup"
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "mid-tier"
scenarios:
   - name: "GET hotels"
     flow:
      - get:
          url: "/9999999"
      - post:
          url: "/"
          json: 
            review: {"hotelid": 9999999, "member": 1000, "title": "Fake title", "text":"I have no text for you buddy stop asking", "triptype": "notfun", "image1": "noUrl", "image2": "noUrl", "image3": "noUrl", "image4": "noUrl", "date": "never posted"}